##  Only for testing

In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv("datasets/test.csv")

df.head()

    name  age     sex  salary     city Family
0    Ram   21    Male  784000    Patna    Yes
1  Sayam   21    Male  845000   Mumbai     No
2  Moham   23    Male  984000    Delhi    Yes
3   Sita   32  Female  440000     Pune    Yes
4  geeta   45  Female  422000  Chennai    Yes

In [6]:
# Test for value_count()

df.value_counts()

name      age  sex     salary  city     Family
Akash     23   Male    456000  Delhi    No        1
Ashu      24   Male    754000  Patna    No        1
Choti     37   Female  654000  Patna    Yes       1
Joti      32   Female  452000  Kolkata  Yes       1
Kamla     27   Female  654000  Delhi    No        1
Kamlesh   51   Male    320400  Delhi    No        1
Komal     45   Female  623000  Kolkata  No        1
Madan     23   Male    650000  Punjab   Yes       1
          31   Male    555000  Delhi    No        1
Mahi      27   Female  854000  Kolkata  No        1
Mani      25   Female  684000  Patna    Yes       1
Manish    32   Male    654000  Pune     Yes       1
Manisha   52   Female  653000  Chennai  Yes       1
Manvi     39   Female  456000  Delhi    Yes       1
Moham     23   Male    984000  Delhi    Yes       1
Mohan     41   Male    654000  Kolkata  No        1
          63   Male    654000  Kolkata  No        1
Moni      53   Female  620000  Mumbai   Yes       1
Pallavi   35   Female  684000  Kolkata  Yes       1
Pragya    37   Female  845000  Lucknow  Yes       1
Preeti    35   Female  694000  Patna    No        1
Pretam    28   Male    845600  Lucknow  Yes       1
Prince    41   Male    856000  Patna    Yes       1
Puja      28   Female  785000  Kolkata  Yes       1
Raj       34   Male    845000  Pune     No        1
Rajesh    34   Male    365000  Delhi    Yes       1
Rajni     26   Female  823000  Chennai  No        1
Rajswari  14   Female  697000  Lucknow  Yes       1
Raju      35   Male    350000  Patna    No        1
Ram       21   Male    784000  Patna    Yes       1
Ramesh    34   Male    542000  Patna    Yes       1
Saloni    23   Female  450600  Chennai  No        1
          36   Female  684000  Pune     Yes       1
Sanoj     43   Male    623000  Pune     Yes       1
Sayam     21   Male    845000  Mumbai   No        1
Sita      32   Female  440000  Pune     Yes       1
Sohan     65   Male    620000  Patna    No        1
Suraj     28   Male    954000  Kolkata  Yes       1
geeta     45   Female  422000  Chennai  Yes       1
Name: count, dtype: int64

In [9]:
df['name'].value_counts()

name
Mohan       2
Saloni      2
Madan       2
Ram         1
Sita        1
Moham       1
Sayam       1
geeta       1
Rajni       1
Komal       1
Raju        1
Sohan       1
Kamlesh     1
Joti        1
Moni        1
Ramesh      1
Sanoj       1
Manish      1
Manisha     1
Akash       1
Rajesh      1
Ashu        1
Raj         1
Suraj       1
Kamla       1
Manvi       1
Mahi        1
Puja        1
Choti       1
Prince      1
Pretam      1
Pragya      1
Preeti      1
Rajswari    1
Pallavi     1
Mani        1
Name: count, dtype: int64

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    39 non-null     object
 1   age     39 non-null     int64
 2   sex     39 non-null     object
 3   salary  39 non-null     int64
 4   city    39 non-null     object
 5   Family  39 non-null     object
dtypes: int64(2), object(4)
memory usage: 2.0+ KB

In [16]:
df['sex'].value_counts()

sex
Male      20
Female    19
Name: count, dtype: int64

In [20]:
df['city'].value_counts()

city
Patna      9
Kolkata    8
Delhi      7
Pune       5
Chennai    4
Lucknow    3
Mumbai     2
Punjab     1
Name: count, dtype: int64

In [25]:
(df['city']=="Patna").sum()

np.int64(9)